load_tests/find_contacts.yaml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 10
      arrivalRate: 1
  variables:
    name: "diego"
    page: 1
    perPage: 10

scenarios:
  - name: "Find contacts by name"
    flow:
      - get:
          url: "contacts/name/{{name}}?page={{page}}&perPage={{perPage}}"
          expect:
            - statusCode: 200